Autodesk.Revit.DB.PDFParameter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PDFParameter.Properties
Properties of the parameter.
Since:
2022

Autodesk.Revit.DB.PDFParameter.Tag
Name of the parameter.
Since:
2022

Autodesk.Revit.DB.PDFParameter.#ctor(System.String,Autodesk.Revit.DB.PDFParameterDictionary)
Initialized a PDF parameter.
tag:
Tag of the parameter.
properties:
Properties of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PDFParameter
Name-value pair in PDF that sets a container's Tag and Properties of its Marked Content.
Since:
2022